Catalogs/DiscountCards.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>DiscountCards</Name>
			<Comment>Magnetic, barcoded and mixed discount cards</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.DiscountCardKinds</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CardCodeBarcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CardCodeMagnetic</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CardOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Comment>Any additional information</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/CardsTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>CardsTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Magnetic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Barcode</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Mixed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/DiscountCards/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ServiceProceduresAndFunctions

// Function checks whether discount cards with the same code (bar or magnetic) as in transmitted data exist in the IB
//
// Parameters:
//  Data - Structure - data on discount card for which the existence of duplicates is checked
//
Function CheckCatalogDuplicatesDiscountCardsByCodes(Data) Export

	Duplicates = New Array;
	
	Query = New Query;
	
	Query = New Query;
	Query.Text = 
		"SELECT ALLOWED
		|	DiscountCards.Ref AS DiscountCard,
		|	DiscountCards.Description,
		|	DiscountCards.CardCodeBarcode,
		|	DiscountCards.CardCodeMagnetic,
		|	DiscountCards.CardOwner,
		|	CASE
		|		WHEN DiscountCards.CardCodeBarcode = &CardCodeBarcode
		|			THEN TRUE
		|		ELSE FALSE
		|	END AS FoundByBarcode,
		|	CASE
		|		WHEN DiscountCards.CardCodeMagnetic = &CardCodeMagnetic
		|			THEN TRUE
		|		ELSE FALSE
		|	END AS FoundByMagneticCode
		|FROM
		|	Catalog.DiscountCards AS DiscountCards
		|WHERE
		|	DiscountCards.Owner = &Owner
		|	AND (DiscountCards.CardCodeBarcode = &CardCodeBarcode
		|				AND &CheckBarcode
		|			OR DiscountCards.CardCodeMagnetic = &CardCodeMagnetic
		|				AND &CheckMagneticCode)
		|	AND DiscountCards.Ref <> &Ref";
	
	Query.SetParameter("Owner", Data.Owner);
	Query.SetParameter("CardCodeMagnetic", Data.CardCodeMagnetic);
	Query.SetParameter("CardCodeBarcode", Data.CardCodeBarcode);
	Query.SetParameter("Ref", Data.Ref);
	Query.SetParameter("CheckBarcode", (Data.Owner.CardType = Enums.CardsTypes.Barcode OR Data.Owner.CardType = Enums.CardsTypes.Mixed) AND 
	                                               ValueIsFilled(Data.CardCodeBarcode));
	Query.SetParameter("CheckMagneticCode", (Data.Owner.CardType = Enums.CardsTypes.Magnetic OR Data.Owner.CardType = Enums.CardsTypes.Mixed) AND 
	                                               ValueIsFilled(Data.CardCodeMagnetic));
	
	Result = Query.Execute();
	DuplicatesSelection = Result.Select();
	While DuplicatesSelection.Next() Do
		Duplicates.Add(DuplicatesSelection.DiscountCard);
	EndDo;
	
	Return Duplicates;
	
EndFunction

#EndRegion

#EndIf
